test/fixtures/submit_payout.json

HTTP/1.1 201 Created
Server: Apache-Coyote/1.1
Set-Cookie: rememberMe=deleteMe; Path=/acceptor; Max-Age=0; Expires=Thu, 26-Mar-2015 16:33:22 GMT
Content-Type: application/json;charset=UTF-8
Transfer-Encoding: chunked
Date: Fri, 27 Mar 2015 16:33:23 GMT

{"processing":{"authResponse":{"statusCode":"1","message":"Success","gatewayReference":"1318715296","gatewaySettlement":"2015-03-27","gatewayMessage":"Success","avsAddressCheck":"FULL_MATCH","cv2Check":"MATCHED","status":"AUTHORISED"},"route":"MCPE"},"paymentMethod":{"card":{"cardToken":"MT_AuY7lNJERzCp9mGRP0S1ZA","new":false,"cardType":"MC_DEBIT","cardUsageType":"DEBIT","cardScheme":"MASTERCARD","maskedPan":"990000******5159","expiryDate":"1215","issuer":"PAYPOINT_TEST_BANK","issuerCountry":"GBR","cardHolderName":"John Doe","cardNickname":"primary card"},"billingAddress":{},"paymentClass":"CARD"},"customer":{"id":"197138","merchantRef":"42"},"transaction":{"transactionId":"10044238245","merchantRef":"xyz-1234","status":"SUCCESS","type":"PAYOUT","amount":4.89,"currency":"GBP","transactionTime":"2015-03-27T16:33:22.718Z","receivedTime":"2015-03-27T16:33:22.718Z"},"fraudGuard":{"score":0},"outcome":{"status":"SUCCESS","reasonCode":"S100","reasonMessage":"Authorised"},"trace":"TzHstVJalvw0DXTr5SrW3-Q","link":[{"rel":"transaction","href":"https://api.mite.paypoint.net:2443/acceptor/rest/transactions/5300014/10044238245"}]}